app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 07 Nov 2012 15:24:53 UTC +00:00], ["title", "asdasdasdadasd"], ["updated_at", Wed, 07 Nov 2012 15:24:53 UTC +00:00]]